In [10]:

import pandas as pd
# SQL Alchemy
from sqlalchemy import create_engine

In [11]:
# Create Engine for sql_challenge

engine = create_engine('postgresql://postgres:boboro@localhost/sql_challenge')
conn = engine.connect()

In [17]:
# Query All Records in the the Census Table
salaries = pd.read_sql("SELECT * FROM salaries", conn)
salaries.head(5)

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228